# TextStyleFont Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TextStyleFont Property
ParameterTypeId Class See Also
---
"Font"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TextStyleFont { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextStyleFont As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TextStyleFont {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace